{
  "title": "ACTHP Learning Module | Artefactchat | Calthorpes' House",
  "postsGroup": "ACT Historic Places",
  "image": {
    "src": "learning-module-artefactchat-calthorpes-house.jpg",
    "alt": "Post Image",
    "citation": "Photo by Benjamin Waller"
  },
  "author": {
    "name": "Benjamin Waller",
    "url": "pages/about"
  },
  "dateCreated": "20 December 2022",
  "dateModified": "",
  "categories": ["Technology Enhanced Learning"],
  "tags": ["H5P", "Primary Ed"],
  "featured": true,
  "draft": true,
  "articleSnapshot": "Find out about how I used H5P's Course Presentation tool to build learning for ACT Historic Places.",
  "articleBody": "This resource was one of 3 learning modules built for ACT Historic Places. The learning is developed from an oral history video featuring Dawn Waterhouse, nee Calthorpe who grew up in the now heritage listed home called Calthorpe's House built in 1927 in Red Hill, Canberra and today operates as a museum.  It was filmed as part of her 90th birthday celebrations in 2017 and provided a glimpse into the life of the Calthorpes’ family as told by Dawn. In the video, she fondly recalls her time growing up in the family home, playing with the neighbourhood children in their garden, cooking potatoes in their Cubby House stove; all of her adventures growing up. As the title of the video suggests, <a target=\"_blank\" href=\"https://youtu.be/4m_ZqnH24UQ\"> Horse rides, drain pipes, mud pies and dress ups </a> were the norm for Dawn and it is a fascinating and rich oral history of her life growing up in Canberra. <br/><br/>So the video content of Dawn formed the basis of this learning module which is called Artefact Chat | Calthorpes' House and is intended for foundation to year two students.(so 5 to 8 year olds) and is designed to be a teacher or parent facilitated learning module.  The themes running through the activity are oral history, so stories told about the past, the different games played, interests and hobbies from the past, specifically Dawn’s memories of her childhood and contrasting that with the present. So I used H5P’s CP again to lay out the content, I matched instructions with audio narrations which were added after early feedback to aid the young learners. <br/><br/> <li>Slide 2 - there is a clear instructions/navigation page and used icons to illustrate this. </li><li>Slide 3 - there is an introduction page showing Dawn as a young child and her today so this slide sets up the content by placing her at her house. (5 years ago)</li><li>Slide 4 - is the first video. I broke down the original 8 minute video into 2 parts, to target specific information; one was focused on the outdoor activities and the other on indoor activities. I used the Interactive Video instead of just a regular video on this slide to build engagement and include revision of the content in the video with a few questions. </li><li>Slide 5 - I added a very simple drag and drop activity again to revise the activities Dawn mentioned in the video. </li><li>Slide 6 - there is further extension of outdoor activities and games with a prompt questions and dialog card (flip card guessing game)</li><li>Slide 7 - Then, I added a completely different interaction which is a short listening activity which was recorded from a funny true story when Dawn was growing up about eating watermelon. So it’s a recording of a young girl to relate the idea of her talking as a young girl.</li>",
  "h5p": {
    "src": "https://edtechdesigner.h5p.com/content/1291678182073032699/embed"
  }
}
