{
  "title": "Casual Conversation Topics - Listening and Speaking",
  "postsGroup": "Education Technology at CIT",
  "image": {
    "src": "bewakoof-com-official-mG-HdjYiPtE-unsplash.jpg",
    "alt": "Post Image",
    "citation": "Photo by <a href='https://unsplash.com/@bewakoofofficial?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText'>Bewakoof.com Official </a> on <a href='https://unsplash.com/?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText'> Unsplash</a>"
  },
  "author": {
    "name": "Benjamin Waller",
    "url": "pages/about"
  },
  "dateCreated": "14 February 2022",
  "dateModified": "",
  "categories": ["Technology Enhanced Learning"],
  "tags": ["CIT", "H5P", "EAL"],
  "featured": true,
  "draft": true,
  "articleSnapshot": "A post illustrating a learning activity built with H5P's Interactive Book for my EAL students on starting and maintaining casual conversations.",
  "articleBody": "<p>This resource comes from a paper based series of lessons on having casual conversations developed for EAL students by a colleague Anna Gobbo. The resources were single page PDFs with the dialogue and some comprehension questions. They were printed out for students and the audio was played from a PC in the classroom. So I chose <b>H5Ps Interactive Book</b to build in this learning activity. It was a good choice because it offers a nice menu for organising your content, lots of options for having interactions.</p> <p>I structured the activity around the topics, added contextual images, and embedded the audio files which are the dialogues. On the page - Starting a Conversation, I hid the dialogue in an accordion because this is first and foremost a listening activity so that was a nice way to make the text available but hidden by default. The next page, I have included an introduction section, then the audio and below that a quiz Question Set, then the dialogue in an <b>Accordion</b> again and a <br>Drag the Words</b> activity. The quiz questions are comprehension questions and mimic the PDF. Also I include a <b>Mark the Words</b> activity and a sound bite above for students to recognise linkings sounds in English. So they have to select the words that have sounds that link and of course this is providing practice for listening and recognising the linked sounds, you would have to teach the concept first. Then after that, I’ve included an <b>Audio recording</b> activity. And if we continue on, the structure repeats. So in this format it can be used to present the lesson in class,  or outside for your student to practise and revise.</p>",
  "h5p": {
    "src": "https://edtechdesigner.h5p.com/content/1291167045295944159/embed"
  }
}
