{
  "title": "Lesson example : Xin Chào | Greetings",
  "postsGroup": "Vietnamese Language Learning",
  "image": {
    "src": "eLearn-vietnamese-lesson-xin-chao-greetings.jpg",
    "alt": "Post Image",
    "citation": "Photo by Benjamin Waller"
  },
  "author": {
    "name": "Benjamin Waller",
    "url": "pages/about"
  },
  "dateCreated": "1 November 2020",
  "dateModified": "",
  "categories": ["Learning Vietnamese"],
  "tags": ["H5P"],
  "featured": true,
  "draft": true,
  "articleSnapshot": "In this post, I explain how I developed a micro-lesson that focuses on basic greetings between teachers and students in Vietnam using the Northern accent at a beginners level in H5P's Course Presentation.",
  "articleBody": "I created this course in the most popular and feature rich <b>Course Presentation</b> and it shows how you can enhance the learning experience by using a multitude of options to create engagement and interaction. One notable example was an innovative use of Course Presentation where I built a beginners lesson on greetings between teachers and students in Vietnamese. I included in a variety of visuals, audio options and quizzing to deliver a concise but comprehensive language lesson. I achieved this by scaffolding the learning in the following ways:<br/><br/> <li>established the context, topic of conversations and use of vocabulary in first slides</li><li>included rich graphics to situate the speakers in the context of their conversation</li><li>used video, images, tables and information texts to expand on concepts and language</li><li>noted grammar explanations of the language on key slides with colour coding</li><li>broke down the conversation line-by-line to aid repetition and fluency</li><li>used Dialog cards to initiate recall of language from the conversation</li><li>incorporated quizzing to reinforce and consolidate understanding of the language</li><br><em>See the example I developed below and find out more about <a target=\"_blank\" href=\"https://h5p.org/presentation\"> H5P Course Presentation</a> on the H5P community site.</em>",
  "h5p": {
    "src": "https://edtechdesigner.h5p.com/content/1291111854993942289/embed"
  }
}
