{
    "title": "The H5P Report - March 2023",
    "postsGroup": "H5P Learning Resources",
    "image": {
      "src": "ThumbNail_H5P_Report_March_2023.webp",
      "alt": "Post Image",
      "citation": "Photo by Benjamin Waller"
    },
    "author": {
      "name": "Benjamin Waller",
      "url": "pages/about"
    },
    "dateCreated": "28 March 2023",
    "dateModified": "",
    "categories": ["YouTube"],
    "tags": ["H5P"],
    "featured": true,
    "draft": true,
    "articleSnapshot": "A post of my first YouTube video featuring H5P Technology. The video celebrates H5P's 10th birthday and its development and growth since its inception in 2013.",
    "articleBody": "This is my first YouTube video on my new channel <strong>EdTech Designer</strong> sharing the the same name as this site. The purpose of the channel is to provide educational content to enrich the community of uses of education technologies such as H5P. This segment, The H5P Report, aims to provide current news of H5P Technology and features H5P content types. I talk about topics related to <a target=\"_blank\" href=\"https://h5p.org/\"> H5P.org </a>, (An open source community driven project of the H5P Group and <a target=\"_blank\" href=\"https://h5p.com/\"> H5P.com </a> their (SaaS) version of H5P. </br>The H5P Report is a news and current affairs segment of the EdTech Designer channel that focuses on H5P Technology. In this March H5P Report, we celebrate H5P's 10th birthday and its development and growth since its inception in 2013. The company has grown from a small team of 4 to a team of over 20 with over 53 content types and supports hundreds of millions of users on over 200 thousand sites worldwide. Joubel has rebranded as the H5P Group to strengthen its connection and dedication to H5P and its aim to be the mainstream authoring standard for content creation on the web. The January release includes a new content type called the Info Wall and improvements to the Interactive Book and support for introductory audio. Also there are updates to the Documentation tool, the inclusion of Image Choice in Quiz, and the ability to have Flashcards in random order and. The CEO, Svein-Tore Griff With, outlined upcoming improvements to H5P, including the H5P OER Hub and simplifying the setup process for developers. </br><em>Below is the YouTube video I posted called, The H5P Report - March 2023. </em>",
    "youtube": {
      "src": "https://www.youtube.com/embed/0J2Rri86s4k"
  }
}