{
  "title": "How to Find and Log in to eLearn at CIT",
  "postsGroup": "Education Technology at CIT",
  "image": {
    "src": "nick-morrison-FHnnjk1Yj7Y-unsplash.webp",
    "alt": "Post Image",
    "citation": "Photo by <a href='https://unsplash.com/@nickmorrison?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText'>Nick Morrison</a> on <a href='https://unsplash.com/?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText'>Unsplash</a>"
  },
  "author": { "name": "Benjamin Waller", "url": "/pages/about" },
  "dateCreated": "6 January 2022",
  "dateModified": "",
  "categories": ["Technology Enhanced Learning"],
  "tags": ["CIT"],
  "featured": true,
  "draft": true,
  "articleSnapshot": "This post illustrates the use short instructional video as a means to support students' learning at CIT",
  "articleBody": "<p>In term 4, 2021, I was asked to explore creating how-to videos for our students in the LLND Support department at CIT.  We found that students were getting critical information too late, sometimes a week after the beginning of the course, so we decided to create some videos on introductory type information such as logging into the LMS, finding your way around a course, how to do the LLN quiz and activating their Office 365 account. I first recorded audio voice overs and then recorded screen captures using Camtasia Studio to match my voice recordings. The workflow of recording screen captures and audio separately seemed to work well because nailing the content that needed to be covered in an audio recording gave me a solid base to then record video screencasts that matched the content. I templated the intro and thumbnail to give a consistent look and feel for all other how-to videos. I also experimented with using background music for one video to see whether this could add a little something to one of the longer videos so it wasn’t so dry and monotonous. </p> <em>Below is an example of one of these how-to videos.</em>",
  "youtube": {
    "src": "https://www.youtube.com/embed/pDGrCRILcUI"
  }
}