{
  "title": "Vietnamese for travellers #1: At the airport",
  "postsGroup": "Vietnamese Language Learning",
  "image": {
    "src": "learn-vietnamese-for-travellers-1-at-the-airport-Vietlingo-.jpg",
    "alt": "Post Image",
    "citation": "Photo by <a href='https://youtu.be/rC7Cvhkdf5o'>VietLingo</a> on <a href='https://youtu.be/rC7Cvhkdf5o'>YouTube</a>"
  },
  "author": {
    "name": "Benjamin Waller",
    "url": "pages/about"
  },
  "dateCreated": "1 November 2021",
  "dateModified": "",
  "categories": ["Learning Vietnamese"],
  "tags": ["H5P"],
  "featured": true,
  "draft": true,
  "articleBody": "This learning activity for beginners level Vietnamese came to me while watching the short 3.5 minute video, embedded on slide 1. It had a series of short exchanges in some real practical situations when at an airport and I thought I could make something of this! Although it targets beginners and the presenters repeat each of their lines in the dialogue twice with the first time slower than the second, it is still the presentation of the language and not really practice.  I didn’t really know what the final learning would look like completely but I started with the idea of breaking up each line of the conversation, one on each slide. That way the learner could practice each line in isolation. Then I thought if I break up the lines of the dialogue into separate slides then I would need to contextualise the conversation with visual aids. So I decided that I needed to:<li>Add images of the speakers</li><li>Some way to indicate who is speaking and who is listening on a given slide</li><li>Images of the context of the interaction i.e. a picture of a passport when asking for one</li><li>Include both slow and more normal pace versions of the audio</li><li>A translation of each line in the dialogue </li><li>A menu for navigating around</li>As I worked on this project, I realised it required a little more sophistication with a content page (Slide 2) for each of the district parts of the conversations as it would help the learner to better understand them. One part was all about the language you might <b>hear</b> at the airport and was spoken by a flight assistant while the other part was all about the language you might <b>say</b> at an airport spoken by a passenger. And these two distinct parts defined the structure of the learning. On the subsequent page, I listed each line of the conversation in number order in a menu with a link to that line. I repeated this structure for the second part. In the final revision of building this activity I included: <li>Colour-coded text for parts of speech such as verbs, nouns and adjectives which matched the translations in english</li><li>A background image of an airport for better contextualisation</li><li>Invisible clickable button on the text of the dialogue in order to play the audio of that line</li><li>Invisible clickable button over the speaker to be able to play the faster paced version of that line</li><li>Speech bubbles for each speaker which contained the spoken text</li><li>A back arrow icon to be able to return to the first line of that sequence of interactions</li><li>A navigation button back to the Youtube video on slide 1.</li> In conclusion, I think it turned out quite well and does provide a lot more individual practice of the language by separating each line of the exchange on different slides with contextual visual and translations to aid understanding. I hope you like it. <em>Below is the H5P example built with <a target=\"_blank\" href=\"https://h5p.org/presentation\"> H5P Course Presentation</a> </em>",
  "h5p": {
    "src": "https://edtechdesigner.h5p.com/content/1291110977233199799/embed"
  }
}